loadtest/load-test-multi-collection.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 20

scenarios:
  - name: Fetch Products
    weight: 6
    flow:
      - get:
          url: "/products?page=1&limit=10"

  - name: Fetch Users
    weight: 1
    flow:
      - get:
          url: "/users?page=1&limit=10"

  - name: Fetch Orders
    weight: 2
    flow:
      - get:
          url: "/orders?page=1&limit=10"

  - name: Search Reviews
    weight: 1
    flow:
      - get:
          url: "/reviews?productId=abc123&sort=date_desc&limit=5"